betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_uart.c
    [..]
    Use function DAL_UART_UnRegisterCallback() to reset a callback to the default
    weak (surcharged) function.
    DAL_UART_UnRegisterCallback() takes as parameters the DAL peripheral handle,
    and the Callback ID.
    This function allows to reset following callbacks:
    (+) TxHalfCpltCallback        : Tx Half Complete Callback.
    (+) TxCpltCallback            : Tx Complete Callback.
    (+) RxHalfCpltCallback        : Rx Half Complete Callback.
    (+) RxCpltCallback            : Rx Complete Callback.
    (+) ErrorCallback             : Error Callback.
    (+) AbortCpltCallback         : Abort Complete Callback.
    (+) AbortTransmitCpltCallback : Abort Transmit Complete Callback.
    (+) AbortReceiveCpltCallback  : Abort Receive Complete Callback.
    (+) MspInitCallback           : UART MspInit.
    (+) MspDeInitCallback         : UART MspDeInit.

    [..]
    For specific callback RxEventCallback, use dedicated registration/reset functions:
    respectively DAL_UART_RegisterRxEventCallback() , DAL_UART_UnRegisterRxEventCallback().

    [..]
    By default, after the DAL_UART_Init() and when the state is DAL_UART_STATE_RESET
    all callbacks are set to the corresponding weak (surcharged) functions:
    examples DAL_UART_TxCpltCallback(), DAL_UART_RxHalfCpltCallback().
    Exception done for MspInit and MspDeInit functions that are respectively
    reset to the legacy weak (surcharged) functions in the DAL_UART_Init()
    and DAL_UART_DeInit() only when these callbacks are null (not registered beforehand).
    If not, MspInit or MspDeInit are not null, the DAL_UART_Init() and DAL_UART_DeInit()
    keep and use the user MspInit/MspDeInit callbacks (registered beforehand).

    [..]
    Callbacks can be registered/unregistered in DAL_UART_STATE_READY state only.
    Exception done MspInit/MspDeInit that can be registered/unregistered
    in DAL_UART_STATE_READY or DAL_UART_STATE_RESET state, thus registered (user)
    MspInit/DeInit callbacks can be used during the Init/DeInit.
    In that case first register the MspInit/MspDeInit user callbacks
    using DAL_UART_RegisterCallback() before calling DAL_UART_DeInit()
    or DAL_UART_Init() function.

    [..]
    When The compilation define USE_DAL_UART_REGISTER_CALLBACKS is set to 0 or
    not defined, the callback registration feature is not available
    and weak (surcharged) callbacks are used.

     [..]
        Three operation modes are available within this driver :

     *** Polling mode IO operation ***
     =================================
     [..]
       (+) Send an amount of data in blocking mode using DAL_UART_Transmit()
       (+) Receive an amount of data in blocking mode using DAL_UART_Receive()

     *** Interrupt mode IO operation ***
     ===================================
     [..]
       (+) Send an amount of data in non blocking mode using DAL_UART_Transmit_IT()
       (+) At transmission end of transfer DAL_UART_TxCpltCallback is executed and user can
            add his own code by customization of function pointer DAL_UART_TxCpltCallback
       (+) Receive an amount of data in non blocking mode using DAL_UART_Receive_IT()
       (+) At reception end of transfer DAL_UART_RxCpltCallback is executed and user can
            add his own code by customization of function pointer DAL_UART_RxCpltCallback
       (+) In case of transfer Error, DAL_UART_ErrorCallback() function is executed and user can
            add his own code by customization of function pointer DAL_UART_ErrorCallback

     *** DMA mode IO operation ***
     ==============================
     [..]
       (+) Send an amount of data in non blocking mode (DMA) using DAL_UART_Transmit_DMA()
       (+) At transmission end of half transfer DAL_UART_TxHalfCpltCallback is executed and user can
            add his own code by customization of function pointer DAL_UART_TxHalfCpltCallback
       (+) At transmission end of transfer DAL_UART_TxCpltCallback is executed and user can
            add his own code by customization of function pointer DAL_UART_TxCpltCallback
       (+) Receive an amount of data in non blocking mode (DMA) using DAL_UART_Receive_DMA()
       (+) At reception end of half transfer DAL_UART_RxHalfCpltCallback is executed and user can
            add his own code by customization of function pointer DAL_UART_RxHalfCpltCallback
       (+) At reception end of transfer DAL_UART_RxCpltCallback is executed and user can
            add his own code by customization of function pointer DAL_UART_RxCpltCallback
       (+) In case of transfer Error, DAL_UART_ErrorCallback() function is executed and user can
            add his own code by customization of function pointer DAL_UART_ErrorCallback
       (+) Pause the DMA Transfer using DAL_UART_DMAPause()
       (+) Resume the DMA Transfer using DAL_UART_DMAResume()
       (+) Stop the DMA Transfer using DAL_UART_DMAStop()


    [..] This subsection also provides a set of additional functions providing enhanced reception
    services to user. (For example, these functions allow application to handle use cases
    where number of data to be received is unknown).

    (#) Compared to standard reception services which only consider number of received
        data elements as reception completion criteria, these functions also consider additional events
        as triggers for updating reception status to caller :
       (+) Detection of inactivity period (RX line has not been active for a given period).
          (++) RX inactivity detected by IDLE event, i.e. RX line has been in idle state (normally high state)
               for 1 frame time, after last received byte.

    (#) There are two mode of transfer:
       (+) Blocking mode: The reception is performed in polling mode, until either expected number of data is received,
           or till IDLE event occurs. Reception is handled only during function execution.
           When function exits, no data reception could occur. DAL status and number of actually received data elements,
           are returned by function after finishing transfer.
       (+) Non-Blocking mode: The reception is performed using Interrupts or DMA.
           These API's return the DAL status.
           The end of the data processing will be indicated through the
           dedicated UART IRQ when using Interrupt mode or the DMA IRQ when using DMA mode.
           The DAL_UARTEx_RxEventCallback() user callback will be executed during Receive process
           The DAL_UART_ErrorCallback()user callback will be executed when a reception error is detected.

    (#) Blocking mode API:
        (+) DAL_UARTEx_ReceiveToIdle()

