betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_uart.c
  huart->gState = DAL_UART_STATE_BUSY;

  /* Disable the peripheral */
  __DAL_UART_DISABLE(huart);

  /* Set the UART Communication parameters */
  UART_SetConfig(huart);

  /* In asynchronous mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CTRL2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CTRL3 register.*/
  CLEAR_BIT(huart->Instance->CTRL2, (USART_CTRL2_LINMEN | USART_CTRL2_CLKEN));
  CLEAR_BIT(huart->Instance->CTRL3, (USART_CTRL3_SCEN | USART_CTRL3_HDEN | USART_CTRL3_IREN));

  /* Enable the peripheral */
  __DAL_UART_ENABLE(huart);

  /* Initialize the UART state */
  huart->ErrorCode = DAL_UART_ERROR_NONE;
  huart->gState = DAL_UART_STATE_READY;
  huart->RxState = DAL_UART_STATE_READY;
  huart->RxEventType = DAL_UART_RXEVENT_TC;

  return DAL_OK;
}

/**
  * @brief  Initializes the half-duplex mode according to the specified
  *         parameters in the UART_InitTypeDef and create the associated handle.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_HalfDuplex_Init(UART_HandleTypeDef *huart)
{
  /* Check the UART handle allocation */
  if (huart == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_UART_HALFDUPLEX_INSTANCE(huart->Instance));
  ASSERT_PARAM(IS_UART_WORD_LENGTH(huart->Init.WordLength));
#if defined(USART_CTRL1_OSMCFG)
  ASSERT_PARAM(IS_UART_OVERSAMPLING(huart->Init.OverSampling));
#endif /* USART_CTRL1_OSMCFG */

  if (huart->gState == DAL_UART_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    huart->Lock = DAL_UNLOCKED;

#if (USE_DAL_UART_REGISTER_CALLBACKS == 1)
    UART_InitCallbacksToDefault(huart);

    if (huart->MspInitCallback == NULL)
    {
      huart->MspInitCallback = DAL_UART_MspInit;
    }

    /* Init the low level hardware */
    huart->MspInitCallback(huart);
#else
    /* Init the low level hardware : GPIO, CLOCK */
    DAL_UART_MspInit(huart);
#endif /* (USE_DAL_UART_REGISTER_CALLBACKS) */
  }

  huart->gState = DAL_UART_STATE_BUSY;

  /* Disable the peripheral */
  __DAL_UART_DISABLE(huart);

  /* Set the UART Communication parameters */
  UART_SetConfig(huart);

  /* In half-duplex mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CTRL2 register,
     - SCEN and IREN bits in the USART_CTRL3 register.*/
  CLEAR_BIT(huart->Instance->CTRL2, (USART_CTRL2_LINMEN | USART_CTRL2_CLKEN));
  CLEAR_BIT(huart->Instance->CTRL3, (USART_CTRL3_IREN | USART_CTRL3_SCEN));

  /* Enable the Half-Duplex mode by setting the HDSEL bit in the CTRL3 register */
  SET_BIT(huart->Instance->CTRL3, USART_CTRL3_HDEN);

  /* Enable the peripheral */
  __DAL_UART_ENABLE(huart);

  /* Initialize the UART state*/
  huart->ErrorCode = DAL_UART_ERROR_NONE;
  huart->gState = DAL_UART_STATE_READY;
  huart->RxState = DAL_UART_STATE_READY;
  huart->RxEventType = DAL_UART_RXEVENT_TC;

  return DAL_OK;
}

/**
  * @brief  Initializes the LIN mode according to the specified
  *         parameters in the UART_InitTypeDef and create the associated handle.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @param  BreakDetectLength Specifies the LIN break detection length.
  *         This parameter can be one of the following values:
  *            @arg UART_LINBREAKDETECTLENGTH_10B: 10-bit break detection
  *            @arg UART_LINBREAKDETECTLENGTH_11B: 11-bit break detection
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_LIN_Init(UART_HandleTypeDef *huart, uint32_t BreakDetectLength)
{
  /* Check the UART handle allocation */
  if (huart == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the LIN UART instance */
  ASSERT_PARAM(IS_UART_LIN_INSTANCE(huart->Instance));

  /* Check the Break detection length parameter */
  ASSERT_PARAM(IS_UART_LIN_BREAK_DETECT_LENGTH(BreakDetectLength));
  ASSERT_PARAM(IS_UART_LIN_WORD_LENGTH(huart->Init.WordLength));
#if defined(USART_CTRL1_OSMCFG)
  ASSERT_PARAM(IS_UART_LIN_OVERSAMPLING(huart->Init.OverSampling));
#endif /* USART_CTRL1_OSMCFG */

  if (huart->gState == DAL_UART_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    huart->Lock = DAL_UNLOCKED;

#if (USE_DAL_UART_REGISTER_CALLBACKS == 1)
    UART_InitCallbacksToDefault(huart);

    if (huart->MspInitCallback == NULL)
    {
      huart->MspInitCallback = DAL_UART_MspInit;
    }

    /* Init the low level hardware */
    huart->MspInitCallback(huart);
#else
    /* Init the low level hardware : GPIO, CLOCK */
    DAL_UART_MspInit(huart);
#endif /* (USE_DAL_UART_REGISTER_CALLBACKS) */
  }

  huart->gState = DAL_UART_STATE_BUSY;

  /* Disable the peripheral */
  __DAL_UART_DISABLE(huart);

  /* Set the UART Communication parameters */
  UART_SetConfig(huart);

  /* In LIN mode, the following bits must be kept cleared:
     - CLKEN bits in the USART_CTRL2 register,
     - SCEN, HDSEL and IREN bits in the USART_CTRL3 register.*/
  CLEAR_BIT(huart->Instance->CTRL2, (USART_CTRL2_CLKEN));
  CLEAR_BIT(huart->Instance->CTRL3, (USART_CTRL3_HDEN | USART_CTRL3_IREN | USART_CTRL3_SCEN));

  /* Enable the LIN mode by setting the LINEN bit in the CTRL2 register */
  SET_BIT(huart->Instance->CTRL2, USART_CTRL2_LINMEN);

  /* Set the USART LIN Break detection length. */
  CLEAR_BIT(huart->Instance->CTRL2, USART_CTRL2_LBDLCFG);
  SET_BIT(huart->Instance->CTRL2, BreakDetectLength);

  /* Enable the peripheral */
  __DAL_UART_ENABLE(huart);

  /* Initialize the UART state*/
  huart->ErrorCode = DAL_UART_ERROR_NONE;
  huart->gState = DAL_UART_STATE_READY;
  huart->RxState = DAL_UART_STATE_READY;
  huart->RxEventType = DAL_UART_RXEVENT_TC;

  return DAL_OK;
}

/**
  * @brief  Initializes the Multi-Processor mode according to the specified
  *         parameters in the UART_InitTypeDef and create the associated handle.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @param  Address USART address
  * @param  WakeUpMethod specifies the USART wake-up method.
  *         This parameter can be one of the following values:
  *            @arg UART_WAKEUPMETHOD_IDLELINE: Wake-up by an idle line detection
  *            @arg UART_WAKEUPMETHOD_ADDRESSMARK: Wake-up by an address mark
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_MultiProcessor_Init(UART_HandleTypeDef *huart, uint8_t Address, uint32_t WakeUpMethod)
{
  /* Check the UART handle allocation */
  if (huart == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_UART_INSTANCE(huart->Instance));

  /* Check the Address & wake up method parameters */
  ASSERT_PARAM(IS_UART_WAKEUPMETHOD(WakeUpMethod));
  ASSERT_PARAM(IS_UART_ADDRESS(Address));
  ASSERT_PARAM(IS_UART_WORD_LENGTH(huart->Init.WordLength));
#if defined(USART_CTRL1_OSMCFG)
  ASSERT_PARAM(IS_UART_OVERSAMPLING(huart->Init.OverSampling));
#endif /* USART_CTRL1_OSMCFG */

  if (huart->gState == DAL_UART_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    huart->Lock = DAL_UNLOCKED;

#if (USE_DAL_UART_REGISTER_CALLBACKS == 1)
    UART_InitCallbacksToDefault(huart);

    if (huart->MspInitCallback == NULL)
    {
      huart->MspInitCallback = DAL_UART_MspInit;
    }

    /* Init the low level hardware */
    huart->MspInitCallback(huart);
#else
    /* Init the low level hardware : GPIO, CLOCK */
    DAL_UART_MspInit(huart);
#endif /* (USE_DAL_UART_REGISTER_CALLBACKS) */
  }

