betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_uart.c
  huart->gState = DAL_UART_STATE_BUSY;

  /* Disable the peripheral */
  __DAL_UART_DISABLE(huart);

  /* Set the UART Communication parameters */
  UART_SetConfig(huart);

  /* In Multi-Processor mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CTRL2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CTRL3 register */
  CLEAR_BIT(huart->Instance->CTRL2, (USART_CTRL2_LINMEN | USART_CTRL2_CLKEN));
  CLEAR_BIT(huart->Instance->CTRL3, (USART_CTRL3_SCEN | USART_CTRL3_HDEN | USART_CTRL3_IREN));

  /* Set the USART address node */
  CLEAR_BIT(huart->Instance->CTRL2, USART_CTRL2_ADDR);
  SET_BIT(huart->Instance->CTRL2, Address);

  /* Set the wake up method by setting the WAKE bit in the CTRL1 register */
  CLEAR_BIT(huart->Instance->CTRL1, USART_CTRL1_WUPMCFG);
  SET_BIT(huart->Instance->CTRL1, WakeUpMethod);

  /* Enable the peripheral */
  __DAL_UART_ENABLE(huart);

  /* Initialize the UART state */
  huart->ErrorCode = DAL_UART_ERROR_NONE;
  huart->gState = DAL_UART_STATE_READY;
  huart->RxState = DAL_UART_STATE_READY;
  huart->RxEventType = DAL_UART_RXEVENT_TC;

  return DAL_OK;
}

/**
  * @brief  DeInitializes the UART peripheral.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_UART_DeInit(UART_HandleTypeDef *huart)
{
  /* Check the UART handle allocation */
  if (huart == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_UART_INSTANCE(huart->Instance));

  huart->gState = DAL_UART_STATE_BUSY;

  /* Disable the Peripheral */
  __DAL_UART_DISABLE(huart);

#if (USE_DAL_UART_REGISTER_CALLBACKS == 1)
  if (huart->MspDeInitCallback == NULL)
  {
    huart->MspDeInitCallback = DAL_UART_MspDeInit;
  }
  /* DeInit the low level hardware */
  huart->MspDeInitCallback(huart);
#else
  /* DeInit the low level hardware */
  DAL_UART_MspDeInit(huart);
#endif /* (USE_DAL_UART_REGISTER_CALLBACKS) */

  huart->ErrorCode = DAL_UART_ERROR_NONE;
  huart->gState = DAL_UART_STATE_RESET;
  huart->RxState = DAL_UART_STATE_RESET;
  huart->ReceptionType = DAL_UART_RECEPTION_STANDARD;
  huart->RxEventType = DAL_UART_RXEVENT_TC;

  /* Process Unlock */
  __DAL_UNLOCK(huart);

  return DAL_OK;
}

/**
  * @brief  UART MSP Init.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */
__weak void DAL_UART_MspInit(UART_HandleTypeDef *huart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(huart);
  /* NOTE: This function should not be modified, when the callback is needed,
           the DAL_UART_MspInit could be implemented in the user file
   */
}

/**
  * @brief  UART MSP DeInit.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */
__weak void DAL_UART_MspDeInit(UART_HandleTypeDef *huart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(huart);
  /* NOTE: This function should not be modified, when the callback is needed,
           the DAL_UART_MspDeInit could be implemented in the user file
   */
}

#if (USE_DAL_UART_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User UART Callback
  *         To be used instead of the weak predefined callback
  * @param  huart uart handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *           @arg @ref DAL_UART_TX_HALFCOMPLETE_CB_ID Tx Half Complete Callback ID
  *           @arg @ref DAL_UART_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref DAL_UART_RX_HALFCOMPLETE_CB_ID Rx Half Complete Callback ID
  *           @arg @ref DAL_UART_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref DAL_UART_ERROR_CB_ID Error Callback ID
  *           @arg @ref DAL_UART_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref DAL_UART_ABORT_TRANSMIT_COMPLETE_CB_ID Abort Transmit Complete Callback ID
  *           @arg @ref DAL_UART_ABORT_RECEIVE_COMPLETE_CB_ID Abort Receive Complete Callback ID
  *           @arg @ref DAL_UART_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref DAL_UART_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @param  pCallback pointer to the Callback function
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_UART_RegisterCallback(UART_HandleTypeDef *huart, DAL_UART_CallbackIDTypeDef CallbackID,
                                            pUART_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    huart->ErrorCode |= DAL_UART_ERROR_INVALID_CALLBACK;

    return DAL_ERROR;
  }
  /* Process locked */
  __DAL_LOCK(huart);

  if (huart->gState == DAL_UART_STATE_READY)
  {
    switch (CallbackID)
    {
      case DAL_UART_TX_HALFCOMPLETE_CB_ID :
        huart->TxHalfCpltCallback = pCallback;
        break;

      case DAL_UART_TX_COMPLETE_CB_ID :
        huart->TxCpltCallback = pCallback;
        break;

      case DAL_UART_RX_HALFCOMPLETE_CB_ID :
        huart->RxHalfCpltCallback = pCallback;
        break;

      case DAL_UART_RX_COMPLETE_CB_ID :
        huart->RxCpltCallback = pCallback;
        break;

      case DAL_UART_ERROR_CB_ID :
        huart->ErrorCallback = pCallback;
        break;

      case DAL_UART_ABORT_COMPLETE_CB_ID :
        huart->AbortCpltCallback = pCallback;
        break;

      case DAL_UART_ABORT_TRANSMIT_COMPLETE_CB_ID :
        huart->AbortTransmitCpltCallback = pCallback;
        break;

      case DAL_UART_ABORT_RECEIVE_COMPLETE_CB_ID :
        huart->AbortReceiveCpltCallback = pCallback;
        break;

      case DAL_UART_MSPINIT_CB_ID :
        huart->MspInitCallback = pCallback;
        break;

      case DAL_UART_MSPDEINIT_CB_ID :
        huart->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        huart->ErrorCode |= DAL_UART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (huart->gState == DAL_UART_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_UART_MSPINIT_CB_ID :
        huart->MspInitCallback = pCallback;
        break;

      case DAL_UART_MSPDEINIT_CB_ID :
        huart->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        huart->ErrorCode |= DAL_UART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    huart->ErrorCode |= DAL_UART_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(huart);

