betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_uart.c
  return status;
}

/**
  * @brief  Unregister an UART Callback
  *         UART callaback is redirected to the weak predefined callback
  * @param  huart uart handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *           @arg @ref DAL_UART_TX_HALFCOMPLETE_CB_ID Tx Half Complete Callback ID
  *           @arg @ref DAL_UART_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref DAL_UART_RX_HALFCOMPLETE_CB_ID Rx Half Complete Callback ID
  *           @arg @ref DAL_UART_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref DAL_UART_ERROR_CB_ID Error Callback ID
  *           @arg @ref DAL_UART_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref DAL_UART_ABORT_TRANSMIT_COMPLETE_CB_ID Abort Transmit Complete Callback ID
  *           @arg @ref DAL_UART_ABORT_RECEIVE_COMPLETE_CB_ID Abort Receive Complete Callback ID
  *           @arg @ref DAL_UART_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref DAL_UART_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_UART_UnRegisterCallback(UART_HandleTypeDef *huart, DAL_UART_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(huart);

  if (DAL_UART_STATE_READY == huart->gState)
  {
    switch (CallbackID)
    {
      case DAL_UART_TX_HALFCOMPLETE_CB_ID :
        huart->TxHalfCpltCallback = DAL_UART_TxHalfCpltCallback;               /* Legacy weak  TxHalfCpltCallback       */
        break;

      case DAL_UART_TX_COMPLETE_CB_ID :
        huart->TxCpltCallback = DAL_UART_TxCpltCallback;                       /* Legacy weak TxCpltCallback            */
        break;

      case DAL_UART_RX_HALFCOMPLETE_CB_ID :
        huart->RxHalfCpltCallback = DAL_UART_RxHalfCpltCallback;               /* Legacy weak RxHalfCpltCallback        */
        break;

      case DAL_UART_RX_COMPLETE_CB_ID :
        huart->RxCpltCallback = DAL_UART_RxCpltCallback;                       /* Legacy weak RxCpltCallback            */
        break;

      case DAL_UART_ERROR_CB_ID :
        huart->ErrorCallback = DAL_UART_ErrorCallback;                         /* Legacy weak ErrorCallback             */
        break;

      case DAL_UART_ABORT_COMPLETE_CB_ID :
        huart->AbortCpltCallback = DAL_UART_AbortCpltCallback;                 /* Legacy weak AbortCpltCallback         */
        break;

      case DAL_UART_ABORT_TRANSMIT_COMPLETE_CB_ID :
        huart->AbortTransmitCpltCallback = DAL_UART_AbortTransmitCpltCallback; /* Legacy weak AbortTransmitCpltCallback */
        break;

      case DAL_UART_ABORT_RECEIVE_COMPLETE_CB_ID :
        huart->AbortReceiveCpltCallback = DAL_UART_AbortReceiveCpltCallback;   /* Legacy weak AbortReceiveCpltCallback  */
        break;

      case DAL_UART_MSPINIT_CB_ID :
        huart->MspInitCallback = DAL_UART_MspInit;                             /* Legacy weak MspInitCallback           */
        break;

      case DAL_UART_MSPDEINIT_CB_ID :
        huart->MspDeInitCallback = DAL_UART_MspDeInit;                         /* Legacy weak MspDeInitCallback         */
        break;

      default :
        /* Update the error code */
        huart->ErrorCode |= DAL_UART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (DAL_UART_STATE_RESET == huart->gState)
  {
    switch (CallbackID)
    {
      case DAL_UART_MSPINIT_CB_ID :
        huart->MspInitCallback = DAL_UART_MspInit;
        break;

      case DAL_UART_MSPDEINIT_CB_ID :
        huart->MspDeInitCallback = DAL_UART_MspDeInit;
        break;

      default :
        /* Update the error code */
        huart->ErrorCode |= DAL_UART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    huart->ErrorCode |= DAL_UART_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(huart);

  return status;
}

/**
  * @brief  Register a User UART Rx Event Callback
  *         To be used instead of the weak predefined callback
  * @param  huart     Uart handle
  * @param  pCallback Pointer to the Rx Event Callback function
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_UART_RegisterRxEventCallback(UART_HandleTypeDef *huart, pUART_RxEventCallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    huart->ErrorCode |= DAL_UART_ERROR_INVALID_CALLBACK;

    return DAL_ERROR;
  }

  /* Process locked */
  __DAL_LOCK(huart);

  if (huart->gState == DAL_UART_STATE_READY)
  {
    huart->RxEventCallback = pCallback;
  }
  else
  {
    huart->ErrorCode |= DAL_UART_ERROR_INVALID_CALLBACK;

    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(huart);

  return status;
}

/**
  * @brief  UnRegister the UART Rx Event Callback
  *         UART Rx Event Callback is redirected to the weak DAL_UARTEx_RxEventCallback() predefined callback
  * @param  huart     Uart handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_UART_UnRegisterRxEventCallback(UART_HandleTypeDef *huart)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(huart);

  if (huart->gState == DAL_UART_STATE_READY)
  {
    huart->RxEventCallback = DAL_UARTEx_RxEventCallback; /* Legacy weak UART Rx Event Callback  */
  }
  else
  {
    huart->ErrorCode |= DAL_UART_ERROR_INVALID_CALLBACK;

    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(huart);
  return status;
}
#endif /* USE_DAL_UART_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group2 IO operation functions
  *  @brief UART Transmit and Receive functions
  *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    This subsection provides a set of functions allowing to manage the UART asynchronous
    and Half duplex data transfers.

    (#) There are two modes of transfer:
       (+) Blocking mode: The communication is performed in polling mode.
           The DAL status of all data processing is returned by the same function
           after finishing transfer.
       (+) Non-Blocking mode: The communication is performed using Interrupts
           or DMA, these API's return the DAL status.
           The end of the data processing will be indicated through the
           dedicated UART IRQ when using Interrupt mode or the DMA IRQ when
           using DMA mode.
           The DAL_UART_TxCpltCallback(), DAL_UART_RxCpltCallback() user callbacks
           will be executed respectively at the end of the transmit or receive process
           The DAL_UART_ErrorCallback()user callback will be executed when a communication error is detected.

    (#) Blocking mode API's are :
        (+) DAL_UART_Transmit()
        (+) DAL_UART_Receive()

    (#) Non-Blocking mode API's with Interrupt are :
        (+) DAL_UART_Transmit_IT()
        (+) DAL_UART_Receive_IT()
        (+) DAL_UART_IRQHandler()

    (#) Non-Blocking mode API's with DMA are :
        (+) DAL_UART_Transmit_DMA()
        (+) DAL_UART_Receive_DMA()
        (+) DAL_UART_DMAPause()
        (+) DAL_UART_DMAResume()
        (+) DAL_UART_DMAStop()

    (#) A set of Transfer Complete Callbacks are provided in Non_Blocking mode:
        (+) DAL_UART_TxHalfCpltCallback()
        (+) DAL_UART_TxCpltCallback()
        (+) DAL_UART_RxHalfCpltCallback()
        (+) DAL_UART_RxCpltCallback()
        (+) DAL_UART_ErrorCallback()

    (#) Non-Blocking mode transfers could be aborted using Abort API's :
        (+) DAL_UART_Abort()
        (+) DAL_UART_AbortTransmit()
        (+) DAL_UART_AbortReceive()
        (+) DAL_UART_Abort_IT()
        (+) DAL_UART_AbortTransmit_IT()
        (+) DAL_UART_AbortReceive_IT()

    (#) For Abort services based on interrupts (DAL_UART_Abortxxx_IT), a set of Abort Complete Callbacks are provided:
        (+) DAL_UART_AbortCpltCallback()
        (+) DAL_UART_AbortTransmitCpltCallback()
        (+) DAL_UART_AbortReceiveCpltCallback()

    (#) A Rx Event Reception Callback (Rx event notification) is available for Non_Blocking modes of enhanced reception services:
        (+) DAL_UARTEx_RxEventCallback()

