betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_uart.c
/** @defgroup UART_Exported_Functions_Group3 Peripheral Control functions
  *  @brief   UART control functions
  *
@verbatim
  ==============================================================================
                      ##### Peripheral Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control the UART:
    (+) DAL_LIN_SendBreak() API can be helpful to transmit the break character.
    (+) DAL_MultiProcessor_EnterMuteMode() API can be helpful to enter the UART in mute mode.
    (+) DAL_MultiProcessor_ExitMuteMode() API can be helpful to exit the UART mute mode by software.
    (+) DAL_HalfDuplex_EnableTransmitter() API to enable the UART transmitter and disables the UART receiver in Half Duplex mode
    (+) DAL_HalfDuplex_EnableReceiver() API to enable the UART receiver and disables the UART transmitter in Half Duplex mode

@endverbatim
  * @{
  */

/**
  * @brief  Transmits break characters.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_LIN_SendBreak(UART_HandleTypeDef *huart)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_UART_INSTANCE(huart->Instance));

  /* Process Locked */
  __DAL_LOCK(huart);

  huart->gState = DAL_UART_STATE_BUSY;

  /* Send break characters */
  ATOMIC_SET_BIT(huart->Instance->CTRL1, USART_CTRL1_TXBF);

  huart->gState = DAL_UART_STATE_READY;

  /* Process Unlocked */
  __DAL_UNLOCK(huart);

  return DAL_OK;
}

/**
  * @brief  Enters the UART in mute mode.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_MultiProcessor_EnterMuteMode(UART_HandleTypeDef *huart)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_UART_INSTANCE(huart->Instance));

  /* Process Locked */
  __DAL_LOCK(huart);

  huart->gState = DAL_UART_STATE_BUSY;

  /* Enable the USART mute mode  by setting the RWU bit in the CTRL1 register */
  ATOMIC_SET_BIT(huart->Instance->CTRL1, USART_CTRL1_RXMUTEEN);

  huart->gState = DAL_UART_STATE_READY;
  huart->RxEventType = DAL_UART_RXEVENT_TC;

  /* Process Unlocked */
  __DAL_UNLOCK(huart);

  return DAL_OK;
}

/**
  * @brief  Exits the UART mute mode: wake up software.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_MultiProcessor_ExitMuteMode(UART_HandleTypeDef *huart)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_UART_INSTANCE(huart->Instance));

  /* Process Locked */
  __DAL_LOCK(huart);

  huart->gState = DAL_UART_STATE_BUSY;

  /* Disable the USART mute mode by clearing the RWU bit in the CTRL1 register */
  ATOMIC_CLEAR_BIT(huart->Instance->CTRL1, USART_CTRL1_RXMUTEEN);

  huart->gState = DAL_UART_STATE_READY;
  huart->RxEventType = DAL_UART_RXEVENT_TC;

  /* Process Unlocked */
  __DAL_UNLOCK(huart);

  return DAL_OK;
}

/**
  * @brief  Enables the UART transmitter and disables the UART receiver.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_HalfDuplex_EnableTransmitter(UART_HandleTypeDef *huart)
{
  uint32_t tmpreg = 0x00U;

  /* Process Locked */
  __DAL_LOCK(huart);

  huart->gState = DAL_UART_STATE_BUSY;

  /*-------------------------- USART CTRL1 Configuration -----------------------*/
  tmpreg = huart->Instance->CTRL1;

  /* Clear TE and RE bits */
  tmpreg &= (uint32_t)~((uint32_t)(USART_CTRL1_TXEN | USART_CTRL1_RXEN));

  /* Enable the USART's transmit interface by setting the TE bit in the USART CTRL1 register */
  tmpreg |= (uint32_t)USART_CTRL1_TXEN;

  /* Write to USART CTRL1 */
  WRITE_REG(huart->Instance->CTRL1, (uint32_t)tmpreg);

  huart->gState = DAL_UART_STATE_READY;

  /* Process Unlocked */
  __DAL_UNLOCK(huart);

  return DAL_OK;
}

/**
  * @brief  Enables the UART receiver and disables the UART transmitter.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_HalfDuplex_EnableReceiver(UART_HandleTypeDef *huart)
{
  uint32_t tmpreg = 0x00U;

  /* Process Locked */
  __DAL_LOCK(huart);

  huart->gState = DAL_UART_STATE_BUSY;

  /*-------------------------- USART CTRL1 Configuration -----------------------*/
  tmpreg = huart->Instance->CTRL1;

  /* Clear TE and RE bits */
  tmpreg &= (uint32_t)~((uint32_t)(USART_CTRL1_TXEN | USART_CTRL1_RXEN));

  /* Enable the USART's receive interface by setting the RE bit in the USART CTRL1 register */
  tmpreg |= (uint32_t)USART_CTRL1_RXEN;

  /* Write to USART CTRL1 */
  WRITE_REG(huart->Instance->CTRL1, (uint32_t)tmpreg);

  huart->gState = DAL_UART_STATE_READY;

  /* Process Unlocked */
  __DAL_UNLOCK(huart);

  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group4 Peripheral State and Errors functions
  *  @brief   UART State and Errors functions
  *
@verbatim
  ==============================================================================
                 ##### Peripheral State and Errors functions #####
  ==============================================================================
 [..]
   This subsection provides a set of functions allowing to return the State of
   UART communication process, return Peripheral Errors occurred during communication
   process
   (+) DAL_UART_GetState() API can be helpful to check in run-time the state of the UART peripheral.
   (+) DAL_UART_GetError() check in run-time errors that could be occurred during communication.

@endverbatim
  * @{
  */

/**
  * @brief  Returns the UART state.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval DAL state
  */
DAL_UART_StateTypeDef DAL_UART_GetState(UART_HandleTypeDef *huart)
{
  uint32_t temp1 = 0x00U, temp2 = 0x00U;
  temp1 = huart->gState;
  temp2 = huart->RxState;

  return (DAL_UART_StateTypeDef)(temp1 | temp2);
}

/**
  * @brief  Return the UART error code
  * @param  huart Pointer to a UART_HandleTypeDef structure that contains
  *               the configuration information for the specified UART.
  * @retval UART Error Code
  */
uint32_t DAL_UART_GetError(UART_HandleTypeDef *huart)
{
  return huart->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup UART_Private_Functions UART Private Functions
  * @{
  */

/**
  * @brief  Initialize the callbacks to their default values.
  * @param  huart UART handle.
  * @retval none
  */
#if (USE_DAL_UART_REGISTER_CALLBACKS == 1)
void UART_InitCallbacksToDefault(UART_HandleTypeDef *huart)
{
  /* Init the UART Callback settings */
  huart->TxHalfCpltCallback        = DAL_UART_TxHalfCpltCallback;        /* Legacy weak TxHalfCpltCallback        */
  huart->TxCpltCallback            = DAL_UART_TxCpltCallback;            /* Legacy weak TxCpltCallback            */
  huart->RxHalfCpltCallback        = DAL_UART_RxHalfCpltCallback;        /* Legacy weak RxHalfCpltCallback        */
  huart->RxCpltCallback            = DAL_UART_RxCpltCallback;            /* Legacy weak RxCpltCallback            */
  huart->ErrorCallback             = DAL_UART_ErrorCallback;             /* Legacy weak ErrorCallback             */
  huart->AbortCpltCallback         = DAL_UART_AbortCpltCallback;         /* Legacy weak AbortCpltCallback         */
  huart->AbortTransmitCpltCallback = DAL_UART_AbortTransmitCpltCallback; /* Legacy weak AbortTransmitCpltCallback */
  huart->AbortReceiveCpltCallback  = DAL_UART_AbortReceiveCpltCallback;  /* Legacy weak AbortReceiveCpltCallback  */
  huart->RxEventCallback           = DAL_UARTEx_RxEventCallback;         /* Legacy weak RxEventCallback           */

